In [348]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib.ticker as ticker
import seaborn as sns

# Kasus Terkonfirmasi Harian Jawa Barat (kth)
kth = pd.read_csv("satgas_covid_19-dp_cvd_agregat_kasus_terkonfirmasi_harian_covid19_jabar_data.csv")

# Jumlah Hasil Test PCR Harian (pcr)
pcr = pd.read_csv("satgas_covid_19-dp_cvd_pcr_akumulasi_per_hari_data.csv")

# Jumlah Penduduk Usia Kerja Terdampak Covid-19 (puk)
puk = pd.read_csv("bps-od_17254_jml_penduduk_usia_kerja_terdampak_covid_19__kategori_t.csv")

# Keterisian Tempat Tidur/Bed Occupation Rate Khusus Covid-19 (bor)
bor = pd.read_csv("satgas_covid_19-dp_cvd_bor_data_rs.csv")

# Persebaran Lokasi Akses Pengguna Pusat Informasi (lap)
lap = pd.read_csv("diskominfo-od_18234_data_sebaran_lokasi_akses_pengguna_pusat_infms_koordin_data.csv")

# Jumlah Akumulasi Hasil Test PCR (pca)
pca = pd.read_csv("satgas_covid_19-dp_cvd_pcr_agregasi_provinsi_data.csv")

# Jumlah Kasus Harian di Kabupaten Bandung Barat
kbb = pd.read_csv("jmlh_kss_cvd_19_kbptn_bndng_brt_sd_dsmbr_thn_2022.csv")

# Jumlah Pengguna Fitur Akses Terbanyak di Website Pusat (fat)
fat = pd.read_csv("diskominfo-od_18234_data_sebaran_lokasi_akses_pengguna_pusat_infms_koordin_data.csv")

# Jumlah Penerima Vaksin 1 pada Rentang Umur Lansia berdasarkan provinsi di Indonesia (va1)
va1 = pd.read_csv("Map - Detail 1_data.csv")

# Jumlah Penerima Vaksin 2 pada Rentang Umur Lansia berdasarkan provinsi di Indonesia (va2)
va2 = pd.read_csv("Map - Detail 2_data.csv")

C:\Users\Aphoey\AppData\Local\Temp\ipykernel_17984\2338216699.py:17: DtypeWarning: Columns (1,2,42) have mixed types. Specify dtype option on import or set low_memory=False.
  bor = pd.read_csv("satgas_covid_19-dp_cvd_bor_data_rs.csv")

## DATA EXPLORATION

Kasus Terkonfirmasi Harian

In [349]:
kth.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1046 entries, 0 to 1045
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   tanggal           1046 non-null   object
 1   total_konfirmasi  1046 non-null   int64
 2   sembuh            1046 non-null   int64
 3   meninggal         1046 non-null   int64
 4   aktif             1046 non-null   int64
 5   id                1046 non-null   int64
dtypes: int64(5), object(1)
memory usage: 49.2+ KB

Menunjukkan 10 data pertama kasus terkonfirmasi harian

In [350]:
kth.head(10)

               tanggal  total_konfirmasi  sembuh  meninggal  aktif  id
0  2020-03-01 00:00:00                 2       0          0      2   1
1  2020-03-02 00:00:00                 2       0          0      2   2
2  2020-03-03 00:00:00                 2       0          1      1   3
3  2020-03-04 00:00:00                 4       0          1      3   4
4  2020-03-05 00:00:00                 4       0          1      3   5
5  2020-03-06 00:00:00                 4       0          1      3   6
6  2020-03-07 00:00:00                 4       0          1      3   7
7  2020-03-08 00:00:00                 5       0          1      4   8
8  2020-03-09 00:00:00                 5       0          1      4   9
9  2020-03-10 00:00:00                 6       0          1      5  10

Mengecek jumlah data Not a Number (NaN) pada jumlah kasus terkonfirmasi harian

In [351]:
kth.isna().sum()

tanggal             0
total_konfirmasi    0
sembuh              0
meninggal           0
aktif               0
id                  0
dtype: int64

Mengecek data yang memiliki jumlah aktif, meninggal, dan sembuh berbeda dari total konfirmasi

In [352]:
kth.loc[kth['total_konfirmasi'] != kth['aktif'] + kth['meninggal'] + kth['sembuh']]

Empty DataFrame
Columns: [tanggal, total_konfirmasi, sembuh, meninggal, aktif, id]
Index: []

Jumlah Hasil Test PCR

In [353]:
pcr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1259 entries, 0 to 1258
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tanggal        1259 non-null   object
 1   positif        1259 non-null   int64
 2   negatif        1259 non-null   int64
 3   inconclusive   1259 non-null   int64
 4   jumlah_sampel  1259 non-null   int64
 5   id             1259 non-null   int64
dtypes: int64(5), object(1)
memory usage: 59.1+ KB

Menampilkan 10 data pertama Jumlah Hasil Test PCR

In [354]:
pcr.head(10)

               tanggal  positif  negatif  inconclusive  jumlah_sampel  id
0  2020-05-27 00:00:00        0        2             0              2   1
1  2020-05-28 00:00:00        1       54             0             55   2
2  2020-05-29 00:00:00       35      314             0            349   3
3  2020-05-30 00:00:00        3      114             0            117   4
4  2020-05-31 00:00:00        1      135             0            136   5
5  2020-06-01 00:00:00        2      105             0            107   6
6  2020-06-02 00:00:00       23      567             0            590   7
7  2020-06-03 00:00:00       30      504             0            534   8
8  2020-06-04 00:00:00       17      399             1            417   9
9  2020-06-05 00:00:00       12      395             0            407  10

Jumlah Penduduk Usia Kerja Terdampak Covid-19

In [355]:
puk.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 7 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   id                         8 non-null      int64
 1   kode_bulan                 8 non-null      int64
 2   nama_bulan                 8 non-null      object
 3   kategori_terdampak         8 non-null      object
 4   jumlah_penduduk_terdampak  8 non-null      float64
 5   satuan                     8 non-null      object
 6   tahun                      8 non-null      int64
dtypes: float64(1), int64(3), object(3)
memory usage: 580.0+ bytes

Menampilkan semua data Jumlah Penduduk Usia Kerja Terdampak Covid-19

In [356]:
puk.head(8)

,id,kode_bulan,nama_bulan,kategori_terdampak,jumlah_penduduk_terdampak,satuan,tahun
0,1,8,AGUSTUS,PENGANGGURAN KARENA COVID-19,0.70,JUTA ORANG,2020
1,2,8,AGUSTUS,BUKAN ANGKATAN KERJA (BAK) KARENA COVID-19,0.16,JUTA ORANG,2020
2,3,8,AGUSTUS,SEMENTARA TIDAK BEKERJA KARENA COVID-19,0.40,JUTA ORANG,2020
3,4,8,AGUSTUS,PENDUDUK BEKERJA YANG MENGALAMI PENGURANGAN JA...,5.10,JUTA ORANG,2020
4,5,2,FEBRUARI,PENGANGGURAN KARENA COVID-19,0.45,JUTA ORANG,2021
5,6,2,FEBRUARI,BUKAN ANGKATAN KERJA (BAK) KARENA COVID-19,0.16,JUTA ORANG,2021
6,7,2,FEBRUARI,SEMENTARA TIDAK BEKERJA KARENA COVID-19,0.26,JUTA ORANG,2021
7,8,2,FEBRUARI,PENDUDUK BEKERJA YANG MENGALAMI PENGURANGAN JA...,3.73,JUTA ORANG,2021

Melakukan drop kolom terhadap kolom 'satuan' dan 'kode_bulan' karena satuan bisa disatukan ke kolom 'jumlah_penduduk_terdampak' dengan cara mengkalikan dengan 1000000 dan 'kode_bulan' karena sudah terdapat nama bulan pada kolom 'nama_bulan'.

In [357]:
puk = puk.drop(columns = ['satuan', 'kode_bulan'])
puk['jumlah_penduduk_terdampak'] = puk['jumlah_penduduk_terdampak'] * 1000000

Menampilkan semua data Jumlah Penduduk Usia Kerja yang Terdampak oleh Covid-19 setelah kolom 'satuan' dan 'kode_bulan' sudah dihapus.

In [358]:
puk.head(8)

,id,nama_bulan,kategori_terdampak,jumlah_penduduk_terdampak,tahun
0,1,AGUSTUS,PENGANGGURAN KARENA COVID-19,700000.0,2020
1,2,AGUSTUS,BUKAN ANGKATAN KERJA (BAK) KARENA COVID-19,160000.0,2020
2,3,AGUSTUS,SEMENTARA TIDAK BEKERJA KARENA COVID-19,400000.0,2020
3,4,AGUSTUS,PENDUDUK BEKERJA YANG MENGALAMI PENGURANGAN JA...,5100000.0,2020
4,5,FEBRUARI,PENGANGGURAN KARENA COVID-19,450000.0,2021
5,6,FEBRUARI,BUKAN ANGKATAN KERJA (BAK) KARENA COVID-19,160000.0,2021
6,7,FEBRUARI,SEMENTARA TIDAK BEKERJA KARENA COVID-19,260000.0,2021
7,8,FEBRUARI,PENDUDUK BEKERJA YANG MENGALAMI PENGURANGAN JA...,3730000.0,2021

Mengecek jumlah data Not a Number (NaN) pada dataframe Jumlah Penduduk Usia Kerja Terdampak oleh Covid-19

In [359]:
puk.isna().sum()

id                           0
nama_bulan                   0
kategori_terdampak           0
jumlah_penduduk_terdampak    0
tahun                        0
dtype: int64

Jumlah Keterisian Kasur berdasarkan Rumah Sakit.

In [360]:
bor.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 377671 entries, 0 to 377670
Data columns (total 45 columns):
 #   Column                                                Non-Null Count   Dtype
---  ------                                                --------------   -----
 0   tanggal_update                                        377671 non-null  object
 1   tanggal_update_api                                    32654 non-null   object
 2   kode_rs                                               377671 non-null  object
 3   rumah_sakit                                           377671 non-null  object
 4   kabupaten_kota                                        377671 non-null  object
 5   rujukan_non_rujukan                                   101752 non-null  object
 6   icu_tanpa_tekanan_negatif_dengan_ventilator_tersedia  377659 non-null  float64
 7   icu_tanpa_tekanan_negatif_dengan_ventilator_terpakai  377659 non-null  float64
 8   icu_tanpa_tekanan_negatif_tanpa_ventilator_tersedia   377659 non-null  float64
 9   icu_tanpa_tekanan_negatif_tanpa_ventilator_terpakai   377659 non-null  float64
 10  icu_tekanan_negatif_dengan_ventilator_tersedia        377659 non-null  float64
 11  icu_tekanan_negatif_dengan_ventilator_terpakai        377659 non-null  float64
 12  icu_tekanan_negatif_tanpa_ventilator_tersedia         377659 non-null  float64
 13  icu_tekanan_negatif_tanpa_ventilator_terpakai         377659 non-null  float64
 14  isolasi_tanpa_tekanan_negatif_tersedia                377659 non-null  float64
 15  isolasi_tanpa_tekanan_negatif_terpakai                377659 non-null  float64
 16  isolasi_tekanan_negatif_tersedia                      377659 non-null  float64
 17  isolasi_tekanan_negatif_terpakai                      377659 non-null  float64
 18  total_icu_covid_tersedia                              377269 non-null  float64
 19  total_icu_covid_terpakai                              377671 non-null  int64
 20  total_icu_covid_percent                               377671 non-null  float64
 21  total_isolasi_covid_tersedia                          377671 non-null  int64
 22  total_isolasi_covid_terpakai                          377671 non-null  int64
 23  total_isolasi_covid_percent                           377671 non-null  float64
 24  nicu_covid_tersedia                                   377396 non-null  float64
 25  nicu_covid_terpakai                                   377396 non-null  float64
 26  nicu_covid_percent                                    377671 non-null  float64
 27  picu_covid_tersedia                                   377396 non-null  float64
 28  picu_covid_terpakai                                   377396 non-null  float64
 29  picu_covid_percent                                    377671 non-null  float64
 30  tersedia_all                                          377671 non-null  int64
 31  terpakai_all                                          377671 non-null  int64
 32  bor_percent                                           377671 non-null  float64
 33  igd_covid_tersedia                                    377396 non-null  float64
 34  igd_covid_terpakai                                    377396 non-null  float64
 35  igd_covid_percent                                     377671 non-null  float64
 36  vk_covid_tersedia                                     377396 non-null  float64
 37  vk_covid_terpakai                                     377396 non-null  float64
 38  vk_covid_percent                                      377671 non-null  float64
 39  tersedia_h_k_m                                        377671 non-null  int64
 40  terpakai_h_k_m                                        377671 non-null  int64
 41  bor_percent_h_k_m                                     377671 non-null  float64
 42  pelayanan_covid                                       313122 non-null  object
 43  index                                                 377671 non-null  int64
 44  id                                                    377671 non-null  int64
dtypes: float64(29), int64(9), object(7)
memory usage: 129.7+ MB

In [361]:
bor.head()
# Kayaknya mending ada yang didrop si kolomnya

,tanggal_update,tanggal_update_api,kode_rs,rumah_sakit,kabupaten_kota,rujukan_non_rujukan,icu_tanpa_tekanan_negatif_dengan_ventilator_tersedia,icu_tanpa_tekanan_negatif_dengan_ventilator_terpakai,icu_tanpa_tekanan_negatif_tanpa_ventilator_tersedia,icu_tanpa_tekanan_negatif_tanpa_ventilator_terpakai,...,igd_covid_percent,vk_covid_tersedia,vk_covid_terpakai,vk_covid_percent,tersedia_h_k_m,terpakai_h_k_m,bor_percent_h_k_m,pelayanan_covid,index,id
0,2021-02-03 00:00:00,NaN,3206083,RS Ibu dan Anak dr. Hj. Karmini EH,Kota Tasikmalaya,NaN,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0,0,0.00,NaN,1,1
1,2021-02-03 00:00:00,NaN,3278014,RS Umum Tasik Medika Citratama (TMC),Kota Tasikmalaya,NaN,0.0,0.0,0.0,0.0,...,40.0,0.0,0.0,0.0,35,33,94.29,NaN,2,2
2,2021-02-03 00:00:00,NaN,3278015,RS Bersalin Ummi,Kota Tasikmalaya,NaN,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0,0,0.00,NaN,3,3
3,2021-02-03 00:00:00,NaN,3278016,RS Ibu dan Anak Sayang Bunda,Kota Tasikmalaya,NaN,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0,0,0.00,NaN,4,4
4,2021-02-03 00:00:00,NaN,3278017,RS Ibu dan Anak Widaningsih,Kota Tasikmalaya,NaN,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0,0,0.00,NaN,5,5

In [362]:
lap.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 672 entries, 0 to 671
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               672 non-null    int64
 1   kode_provinsi    672 non-null    int64
 2   nama_provinsi    672 non-null    object
 3   lokasi_akses     672 non-null    object
 4   jumlah_pengguna  672 non-null    int64
 5   satuan           672 non-null    object
 6   tahun            672 non-null    int64
dtypes: int64(4), object(3)
memory usage: 36.9+ KB

In [363]:
lap.head()

   id  kode_provinsi nama_provinsi lokasi_akses  jumlah_pengguna satuan  tahun
0   1             32    JAWA BARAT      BANDUNG            46360   USER   2022
1   2             32    JAWA BARAT      JAKARTA            34906   USER   2022
2   3             32    JAWA BARAT  KOTA BEKASI             9993   USER   2022
3   4             32    JAWA BARAT     SURABAYA             5175   USER   2022
4   5             32    JAWA BARAT        DEPOK             3653   USER   2022

In [364]:
lap = lap.drop(columns = ['kode_provinsi', 'nama_provinsi', 'satuan'])
lap.head(15)

    id       lokasi_akses  jumlah_pengguna  tahun
0    1            BANDUNG            46360   2022
1    2            JAKARTA            34906   2022
2    3        KOTA BEKASI             9993   2022
3    4           SURABAYA             5175   2022
4    5              DEPOK             3653   2022
5    6          PALEMBANG             3449   2022
6    7           MAKASSAR             2954   2022
7    8             BEKASI             2607   2022
8    9        TASIKMALAYA             2236   2022
9   10          PEKANBARU             1776   2022
10  11            CIREBON             1613   2022
11  12              BOGOR             1611   2022
12  13           SEMARANG             1510   2022
13  14  TANGERANG SELATAN             1051   2022
14  15              MEDAN              988   2022

In [365]:
# pca
pca.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1288 entries, 0 to 1287
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   hari             1288 non-null   object
 1   tanggal          1288 non-null   object
 2   jumlah_sampling  1288 non-null   int64
 3   positif          1288 non-null   int64
 4   negatif          1288 non-null   int64
 5   invalid          1288 non-null   int64
 6   id               1288 non-null   int64
dtypes: int64(5), object(2)
memory usage: 70.6+ KB

In [366]:
pca = pca.drop(columns=['hari'])
pca.head()

               tanggal  jumlah_sampling  positif  negatif  invalid  id
0  2023-07-19 00:00:00          5555193  1448357  4094357    12479   1
1  2023-07-15 00:00:00          5554701  1448344  4093879    12478   2
2  2023-07-14 00:00:00          5554515  1448334  4093703    12478   3
3  2023-07-13 00:00:00          5554292  1448328  4093486    12478   4
4  2023-07-12 00:00:00          5554125  1448323  4093324    12478   5

In [367]:
# kbb
kbb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 165 entries, 0 to 164
Data columns (total 8 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    165 non-null    int64
 1   kecamatan             165 non-null    object
 2   desa                  165 non-null    object
 3   konfirmasi_total      165 non-null    int64
 4   konfirmasi_sembuh     165 non-null    int64
 5   konfirmasi_meninggal  165 non-null    int64
 6   kontak_erat           165 non-null    int64
 7   suspek                165 non-null    int64
dtypes: int64(6), object(2)
memory usage: 10.4+ KB

In [368]:
kbb.head()

,id,kecamatan,desa,konfirmasi_total,konfirmasi_sembuh,konfirmasi_meninggal,kontak_erat,suspek
0,1,Rongga,Cicadas,7,7,0,0,0
1,2,Rongga,Cibedug,73,73,0,7,1
2,3,Rongga,Sukamanah,52,52,0,6,0
3,4,Rongga,Bojong,55,55,0,1,1
4,5,Rongga,Bojongsalam,11,11,0,7,1

In [369]:
fat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 672 entries, 0 to 671
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   id               672 non-null    int64
 1   kode_provinsi    672 non-null    int64
 2   nama_provinsi    672 non-null    object
 3   lokasi_akses     672 non-null    object
 4   jumlah_pengguna  672 non-null    int64
 5   satuan           672 non-null    object
 6   tahun            672 non-null    int64
dtypes: int64(4), object(3)
memory usage: 36.9+ KB

In [370]:
fat.head()

   id  kode_provinsi nama_provinsi lokasi_akses  jumlah_pengguna satuan  tahun
0   1             32    JAWA BARAT      BANDUNG            46360   USER   2022
1   2             32    JAWA BARAT      JAKARTA            34906   USER   2022
2   3             32    JAWA BARAT  KOTA BEKASI             9993   USER   2022
3   4             32    JAWA BARAT     SURABAYA             5175   USER   2022
4   5             32    JAWA BARAT        DEPOK             3653   USER   2022

In [371]:
va1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 1 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   provinsi_sasaran;divaksin_1  35 non-null     object
dtypes: object(1)
memory usage: 412.0+ bytes

In [372]:
va1.head()

  provinsi_sasaran;divaksin_1
0           YOGYAKARTA;410448
1       SUMATERA UTARA;986519
2     SUMATERA SELATAN;455619
3       SUMATERA BARAT;511079
4       SULAWESI UTARA;189302

In [373]:
va2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 1 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   provinsi_sasaran;divaksin_2  35 non-null     object
dtypes: object(1)
memory usage: 412.0+ bytes

In [374]:
va2.head()

  provinsi_sasaran;divaksin_2
0           YOGYAKARTA;375801
1       SUMATERA UTARA;850261
2     SUMATERA SELATAN;353171
3       SUMATERA BARAT;399757
4       SULAWESI UTARA;146149

## ANALYSIS AND VISUALIZATIONS